OpenFOAM/libAcoustics-OF3.0.0/cases/tandem-65k-1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pFinal)"
    {
        solver          PCG;
        tolerance       1e-07;
        relTol          1e-5;
//        preconditioner	DIC;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0.01;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            cacheAgglomeration no;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

    }
    
    "(U|k|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
}

PISO
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
//    U		0.7;
//    p		0.3;
//    k		0.7;
//    omega	0.7;
}

// ************************************************************************* //
